[{
        "_id": NumberInt(1),
        "movie": NumberInt(1),
        "review": "Why do I want to write the 234th comment on The Shawshank Redemption? I am not sure - almost everything that could be possibly said about it has been said. But like so many other people who wrote comments, I was and am profoundly moved by this simple and eloquent depiction of hope and friendship and redemption."
    },
    {
        "_id": NumberInt(2),
        "movie": NumberInt(1),
        "review": "I have never seen such an amazing film since I saw The Shawshank Redemption. Shawshank encompasses friendships, hardships, hopes, and dreams. And what is so great about the movie is that it moves you, it gives you hope. Even though the circumstances between the characters and the viewers are quite different, you don't feel that far removed from what the characters are going through."
    },
    {
        "_id": NumberInt(3),
        "movie": NumberInt(1),
        "review": "The Shawshank Redemption served as a message of hope to Hollywood as well. More than any film in memory, it proved there is life after box office. Besting Forrest and Fiction, it ran solely on strong word of mouth and became the hottest rented film of 1995."
    },
    {
        "_id": NumberInt(4),
        "movie": NumberInt(1),
        "review": "The reason I became a member of this database is because I finally found a movie ranking that recognized the true greatness of this movie. There is nary a word or scene out of place in the entire thing. Every element comes together to form an exquisite story for cinema. I believe that one reason that this movie is under-appreciated is that people have not seen it multiple times."
    },
    {
        "_id": NumberInt(5),
        "movie": NumberInt(1),
        "review": "One of my all time favorites. Shawshank Redemption is a very moving story about hope and the power of friendship. The cast is first rate with everyone giving a great performance. Tim Robbins and Morgan Freeman carry the movie, but Bob Gunton and Clancy Brown are perfect as the Warden Norton and prison guard captain Hadley respectively. And James Whitmore's portrail of an elderly inmate Brooks is moving. The screenplay gives almost every actor at least one or more memorable lines through out the film."
    },
    {
        "_id": NumberInt(6),
        "movie": NumberInt(2),
        "review": "Rather than concentrating on everything that is great about The Godfather, a much easier way for me to judge its quality is on what is bad about it. Almost every film has something that I don't like about it, but I can honestly say that I wouldn't change anything about The Godfather. There is nothing weak about it and nothing that stands out as bad. That's why it gets ten out of ten."
    },
    {
        "_id": NumberInt(7),
        "movie": NumberInt(2),
        "review": "This is by far the best movie ever to give a portrait organized crime, this movie goes deep inside and shows it all inside out.."
    },
    {
        "_id": NumberInt(8),
        "movie": NumberInt(2),
        "review": "The Godfather is one of the few films in which I personally did not find any significant weakness even after many viewings. From the direction, to the acting, to the storyline, to the score, The Godfather has the word classic written all over, and it really is not much of a surprise that it is now considered by many one of the top five movies of all time. Perhaps when it comes to cinematic techniques The Godfather has not been as revolutionary as Citizen Kane, but its influence on motion pictures is comparable. Rarely a movie has defined or re-defined a genre as much as this one did for 'gangster movies', but its influence goes well beyond that."
    },
    {
        "_id": NumberInt(9),
        "movie": NumberInt(2),
        "review": "This movie is strong, good script, great casting, excellent acting, and over the top directing. It is hard to fine a movie done this well, it is 29 years old and has aged well. Even if the viewer does not like mafia type of movies, he or she will watch the entire film, the audiences is glued to what will happen next as the film progresses. Its about, family, loyalty, greed, relationships, and real life. This is a great mix, and the artistic style make the film memorable."
    },
    {
        "_id": NumberInt(10),
        "movie": NumberInt(2),
        "review": "This is a masterpiece. A timeless masterpiece. Initially, I didn't like this film all that much - I found it rather over-hyped and boring. This was until the advent of DVD, which gave me the feature I needed for this sort of film: subtitles. Once I switched them on and heard (read) every last word of Brando's ramblings and other characters ramblings, I grew a true appreciation for this epic."
    },
    {
        "_id": NumberInt(11),
        "movie": NumberInt(2),
        "review": "The Godfather is one of the very few films that doesn't have a single flaw. Seeing The Godfather for the first time was the most amazing movie experiences of my life. There's scenes that stay with you when the movies over, and you don't forget them. Everyone makes the mistake of calling this film a movie about crime. Its really a movie about family."
    },
    {
        "_id": NumberInt(12),
        "movie": NumberInt(3),
        "review": "This movie is way to be good to be labelled a sequel to The Godfather . Rather it is more of a companion piece to the original and the two perfectly compliment each other . IT is both a sequel and prequel showing the rise of the young vito and moral decline of Micheal . Both characters are brought to life with uncanny ability by Robert DeNiro and Al Pacino . To say that these two are good actors is like saying that a nuclear bomb makes a loud noise and in this movie they prove why they are at the top of their respective crafts ."
    },
    {
        "_id": NumberInt(13),
        "movie": NumberInt(3),
        "review": "The original Godfather is a brilliant work. It is in a sense a voyeuristic delight, allowing us to see the mafia from the inside - we become part of the family. It single-handedly change the world's view of organized crime, and created a cast of sympathetic characters, none of whom have a shred of common morality. It was the highest grossing movie of its time and Brando created a cultural icon whose influence resonates as strong today as it did in 1972."
    },
    {
        "_id": NumberInt(14),
        "movie": NumberInt(3),
        "review": "The second part of Francis Ford Coppola's Epic and violent Gangster Trilogy, follows the reign of Don Michael Corleone as the head of the Corleone family. As well the film shows us the early years of Vito Corleone (Marlon Brando) played flawlessly by Academy Award Winner Robert De Niro, and how he created his empire of money, gambling and respect. Beautifully directed by Francis Ford Coppola, Godfather Part II exceeds every expectation with outstanding performances from Academy Award winners Al Pacino,Diane Keaton, Robert Duvall and Robert De Niro. The second part of this unforgettable trilogy is one of the finest films ever made. "
    },
    {
        "_id": NumberInt(15),
        "movie": NumberInt(3),
        "review": "After seeing The Godfather and improving it as one of my favorite films, I wanted to get more into The Godfather so I rented this. Words can't describe how great this sequel was. The acting once again was amazing and the story and how the movie went on just never got me bored. Everything in this movie was clearly beautiful. The ending by far was my favorite when there all sitting at the table talking. There were so many great scenes like Vito when he was younger, Fredo at the lake, and many many more. You have to see this movie because it's just brilliant filmaking. It's not better than it's first film but still an extremely worth sequel."
    },
    {
        "_id": NumberInt(16),
        "movie": NumberInt(3),
        "review": "The good news is that The Godfather Part II has many amazing qualities, including fantastic performances from a superb cast, sublime, unprecedented visuals that no one else has been able to capture since, and very engaging stories. The bad news is that this should have easily been a 10, but overall, it is so sprawling and unfocused that I can't possibly give it more than a 9, which it only earns because the assets transcend what's basically a mess overall. "
    },
    {
        "_id": NumberInt(17),
        "movie": NumberInt(3),
        "review": "To me and probably to many other people The Godfather Part II is more of a continuation than sequel to The Godfather. Just look at the IMDb rating and you'll see I'm not the only one who feels this way. To me it as good as the first."
    },
    {
        "_id": NumberInt(18),
        "movie": NumberInt(3),
        "review": "This sequel is just as terrific as the first film, if not more so. I hesitate to call it a sequel, as 'sequel' is quite simply the wrong word I am looking for. A film like 'The Matrix Reloaded' is a sequel - 'The Godfather Part II' is something more. It's just too good to be called a sequel."
    },
    {
        "_id": NumberInt(19),
        "movie": NumberInt(4),
        "review": "We've been subjected to enormous amounts of hype and marketing for the Dark Knight. We've seen Joker scavenger hunts and one of the largest viral campaigns in advertising history and it culminates with the actual release of the movie. This is the first time I can remember where a summer blockbuster film far surpasses the hype."
    },
    {
        "_id": NumberInt(20),
        "movie": NumberInt(4),
        "review": "I had the honor of watching TDK during a screening and was completely blown away! This isn't just the best Batman movie ever made, this is one of the best movie ever made. Everything in this film is excellent, not one piece of annoyance."
    },
    {
        "_id": NumberInt(21),
        "movie": NumberInt(4),
        "review": "I must say I was excited for this movie since the instant BATMAN BEGINS appeared on screen at the end of the first film. It was always going to be good, and sadly, it was always going to be over-hyped by the advertising warhorses."
    },
    {
        "_id": NumberInt(22),
        "movie": NumberInt(4),
        "review": "Christopher Nolan's 'The Dark Knight' is one of the better films in the history of its genre, however, it does not qualify as a masterpiece. In fact, it's quite far from such a distinction. It falls short of unquestionable excellence because of a ridiculously high number of plot holes, most of which regard The Joker and his criminal exploits."
    },
    {
        "_id": NumberInt(23),
        "movie": NumberInt(5),
        "review": "This film is superb, in fact as Shakespeare once said 'Its the bees' knees'. The film captivates the audience from the beginning. Each of the twelve jurors are introduced to us as they are introduced to themselves. The characters are well draw out and individual, each with his own personality."
    },
    {
        "_id": NumberInt(24),
        "movie": NumberInt(5),
        "review": "'12 Angry Men' is an outstanding film. It is proof that, for a film to be great, it does not need extensive scenery, elaborate costumes or expensive special effects - just superlative acting."
    },
    {
        "_id": NumberInt(25),
        "movie": NumberInt(5),
        "review": "Films rarely get this uplifting and brilliant. I cannot think of the last time I was so intrigued by the flawless plot, dialogue and acting since 12 Angry Men. For such a simplistic story set in one jury room, it is surprising that Sidney Lumet can drain you of all your emotions and leave you on the edge of your seat with suspense, mystery, and some of the best acting your bound to ever see grace the silver screen!"
    },
    {
        "_id": NumberInt(26),
        "movie": NumberInt(5),
        "review": "This film deserves to be on anyone's list of top films. My problem is that it is so perfect, so seamlessly polished, it is hard to appreciate the individual excellences."
    },
    {
        "_id": NumberInt(27),
        "movie": NumberInt(5),
        "review": "12 Angry Men is a terrific film that reflects a lot of the past problems and the proposed solutions of immigration, youth violence, and of course, overcoming one's own background and discrimination. The film surprised me in how progressive it was, and the ending social conclusions that it reached."
    },
    {
        "_id": NumberInt(28),
        "movie": NumberInt(6),
        "review": "Spielberg is now the Numero Uno director of schmaltzy cinema. I thought Saving Private Ryan was the ultimate good guys save the poor soul, but this one outdoes Ryan in every conceivable heart-tugging, noble humanity fashion."
    },
    {
        "_id": NumberInt(29),
        "movie": NumberInt(6),
        "review": "i just watched this movie and i found it boring 3 hours for nothing this movie is just to make people feel sorry about the Jewish i want to say we must feel sorry about any human.. Jewish have made many holocaust in Palestine and no one said a word."
    },
    {
        "_id": NumberInt(30),
        "movie": NumberInt(7),
        "review": "Pulp Fiction may be the single best film ever made, and quite appropriately it is by one of the most creative directors of all time, Quentin Tarantino."
    },
    {
        "_id": NumberInt(31),
        "movie": NumberInt(7),
        "review": "Viewers are taken on a ride through three different stories that entertwine together around the world of Marcellus Wallace. Quentin Tarantino proves that he is the master of witty dialogue and a fast plot that doesn't allow the viewer a moment of boredom or rest."
    },
    {
        "_id": NumberInt(32),
        "movie": NumberInt(7),
        "review": "I can only speak for myself, but I had never seen anything as stylish, cleverly constructed, well written and electrifying as this milestone when I first saw it in 1994."
    },
    {
        "_id": NumberInt(33),
        "movie": NumberInt(7),
        "review": "Tarantino is without a doubt one of the best directors of all time and maybe the best of the 90's. His first film, Reservoir Dogs was amazing and claustrophobic, his segment in Four Rooms was by far the greatest (even though Rodriguez's was excellent too)and Jackie Brown is a wonderful homage to the Blaxploitation films of the 70's. However, Pulp Fiction remains my favourite."
    },
    {
        "_id": NumberInt(34),
        "movie": NumberInt(7),
        "review": " just finished screening this movie for the first time after putting it off for a number of years because of what seemed like equivocating appraisals from some of my friends."
    },
    {
        "_id": NumberInt(35),
        "movie": NumberInt(8),
        "review": "Peter Jackson has done it. He has created an all-encompassing epic saga of Tolkien's Lord of the Rings books, and after coming away from the final chapter, how does this rate not only as a film on its own, but as a part of the whole?"
    },
    {
        "_id": NumberInt(36),
        "movie": NumberInt(8),
        "review": "As a movie watcher, I tend to become bored with the constant, overdone, overdrawn, underplayed, overdramatized performance and production quality of most Hollywood films. It's a trait that in recent years has sadly driven me away from most big budget American films. A decent idea will become mangled by the money making machine that is Hollywood, hoping to pump the most raw cash they can out of it before it drops dead in the street."
    },
    {
        "_id": NumberInt(37),
        "movie": NumberInt(8),
        "review": "Obviously, I'm aware of the fact that the Lord of the Rings trilogy is actually one giant movie, but since it was released in parts, that's how I'm judging them. The Return Of The King is the final chapter, and since it is the climax and resolution of the epic journey, it has a little more intensity and urgency than the previous installments."
    },
    {
        "_id": NumberInt(38),
        "movie": NumberInt(8),
        "review": "Frodo and Sam continue their quest to destroy the ring, led by the untrustworthy Gollum. Meanwhile the rest of the Fellowship prepare for another battle to hold a human city against an onslaught of orcs."
    },
    {
        "_id": NumberInt(39),
        "movie": NumberInt(8),
        "review": "This is the final movie in the Lord of the Rings trilogy, and certainly doesn't disappoint like some other trilogies *coughMatrixcough*. The three films had their principal shooting all done at the same time, which lowers their overall costs and keeps a good sense of continuity for the films."
    },
    {
        "_id": NumberInt(40),
        "movie": NumberInt(9),
        "review": "A sprawling Western epic that follows the adventures of three gunfighters looking for $200,000 in stolen gold, Sergio Leone's `The Good, the Bad, and the Ugly' is a masterpiece, one that continues to get better and better with each viewing."
    },
    {
        "_id": NumberInt(41),
        "movie": NumberInt(9),
        "review": "This is without a doubt my all-time favorite western."
    },
    {
        "_id": NumberInt(42),
        "movie": NumberInt(9),
        "review": "I wasn't sure if I was going to comment on this film because everything has already been said by the hundreds of other people who have posted their thoughts, but I decided that I should really put my two cents in since this is my favorite movie."
    },
    {
        "_id": NumberInt(43),
        "movie": NumberInt(10),
        "review": "This movie is dark and disturbing, however, it is equally smart and stylistic. I found it hard to watch at points, but I couldn't turn my eyes away. Fight Club makes many bold statements against the modern consumer-driven society, and produces Norton's best performance and Pitt's second best (12 Monkeys)."
    },
    {
        "_id": NumberInt(44),
        "movie": NumberInt(10),
        "review": "I am, unfortunately, not one of the faithful Chuck Palahniuk readers who had read the book BEFORE they saw the movie. I, however, couldn't wait to read the book after seeing this film. I've read the book 5 times since and seen the movie more times than I can remember."
    },
    {
        "_id": NumberInt(45),
        "movie": NumberInt(10),
        "review": "Fight Club is one of the most unique films I have ever seen. In addition to presenting a rather fresh take on life, FC also presents its material in a fresh way. My main interest in the film is in that, in my opinion, it does not present characters for us to think about. Rather, it presents actions for us to think about."
    },
    {
        "_id": NumberInt(46),
        "movie": NumberInt(10),
        "review": "The script was tight, the theme fascinating, the acting incredible (especially Edward Norton, as one might expect), the direction inspired, and the cinematography stunning."
    },
    {
        "_id": NumberInt(47),
        "movie": NumberInt(10),
        "review": "Fight Club is a brash slap in the face of consumerism and the working dead. It questions reality. It is strikingly thought provoking and visually stimulating."
    },
    {
        "_id": NumberInt(48),
        "movie": NumberInt(11),
        "review": "Star Wars has been dethroned. Although George Lucas' movies are good in their own right (except for the juvenile elements he puts in to sell toys to finance the franchise), his scripts (which borrow heavily from J.R.R.Tolkien, mythology & religion) can't compare with the brilliance of the literary trilogy `The Lord of the Rings'."
    },
    {
        "_id": NumberInt(49),
        "movie": NumberInt(11),
        "review": "It is with no surprise that Peter Jackson's The Fellowship of the Ring film has received such mixed critics. Many viewers refer to it as being childish, boring and uninteresting. Seems to me that it is bound to the same fate of Tolkien's books, destined to be a target for the same type of misunderstandings that keep attacking this literary masterpiece many decades after it's first publication."
    },
    {
        "_id": NumberInt(50),
        "movie": NumberInt(11),
        "review": "Breathtaking. Unique. Captivating. Enchanting."
    },
    {
        "_id": NumberInt(51),
        "movie": NumberInt(11),
        "review": "There's a very obvious problem when transferring any book to the big screen, namely that some of us may already have seen it."
    },
    {
        "_id": NumberInt(52),
        "movie": NumberInt(12),
        "review": "I believe everyone has a right to their opinion about films or other topics. However from a lot of the comments I have read about this film, I do not think many got the gist of the message from the author and the film maker. This film is a great modern fable, a fable in the dictionary is defined as a brief fictitious story that teaches a moral. There are many morals defined in this film but foremost is integrity and a simple goodness."
    },
    {
        "_id": NumberInt(53),
        "movie": NumberInt(12),
        "review": "Quite simply, the greatest film ever made. Humour, sadness, action, drama and a Vietnam film all rolled into one."
    },
    {
        "_id": NumberInt(54),
        "movie": NumberInt(12),
        "review": "This is a powerful yet charming movie; fun for its special effects and profound in how it keeps you thinking long after it's over. Like others, I've seen this movie more than once."
    },
    {
        "_id": NumberInt(55),
        "movie": NumberInt(12),
        "review": "I've seen most of the top-voted 30 or 40 movies here at IMDb, and Forrest Gump probably wins my vote for the single best movie ever made."
    },
    {
        "_id": NumberInt(56),
        "movie": NumberInt(12),
        "review": "This awesome movie is about an innocent man who represents how the world should be: he's loyal, humble, honest, he would never cheat or lie. He does everything with good heart and reaches success at the most important tasks of life."
    },
    {
        "_id": NumberInt(57),
        "movie": NumberInt(12),
        "review": "Winston Groom's Forrest Gump was a novel that was complicated, but (Oscar winning) director Robert Zemeckis brings events together with visual effects that boggle even George Lucas."
    },
    {
        "_id": NumberInt(58),
        "movie": NumberInt(13),
        "review": "The Rebellion has struck an important blow to the power of the Empire by destroying it's Death Star, however the power of the Dark Side of the Force remains strong and continues to hunt the rebellion."
    },
    {
        "_id": NumberInt(59),
        "movie": NumberInt(13),
        "review": "My five children were all pre-teens when 'The Empire Strikes Back' came to the theater. While there had been other Sci-Fi movies with a theme of conflict in outer space, the 'Star Wars' trilogy filled our imaginations like no other movies before them."
    },
    {
        "_id": NumberInt(60),
        "movie": NumberInt(13),
        "review": "An excellent sequel to Star Wars, this is easily the darkest and most serious out of all the Star Wars films, at least until Revenge of the Sith comes out."
    },
    {
        "_id": NumberInt(61),
        "movie": NumberInt(14),
        "review": "What is the most resilient parasite? An Idea! Yes, Nolan has created something with his unbelievably, incredibly and god- gifted mind which will blow the minds of the audience away. The world premiere of the movie, directed by Hollywood's most inventive dreamers, was shown in London and has already got top notch reviews worldwide and has scored maximum points! Now the question arises what the movie has that it deserve all this?"
    },
    {
        "_id": NumberInt(62),
        "movie": NumberInt(14),
        "review": "Usually I try to be careful with over hyping a film, or setting the expectations too high, as film geeks all are guilty for, however for Christopher Nolan's Inception, this really is not possible."
    },
    {
        "_id": NumberInt(63),
        "movie": NumberInt(15),
        "review": "Peter Jackson truly outdid himself when creating the Lord of the Rings: The Fellowship of the Ring and he fails to disappoint us in the 2nd part of the Trilogy. The Two Towers shows us that he is not a one-hit wonder, like so many directors are. I actually think that The Two Towers reaches the same level as the Fellowship of the Ring, and sometimes even surpasses it."
    },
    {
        "_id": NumberInt(64),
        "movie": NumberInt(15),
        "review": "It seems ridiculous to want to add my own comments to a slew of others that are already in IMDB's records, but I feel like I cannot sleep nor cease the throbbing in my chest until I release some of what I have so recently seen."
    },
    {
        "_id": NumberInt(65),
        "movie": NumberInt(15),
        "review": "Seriously, I never thought a movie could get better than the Fellowship of the Ring, but it did. This movie should be #1 on the IMDb top 250. This movie, as long as it was, captivated me from start to finish, and those who are not entertained by this movie can not be entertained period."
    },
    {
        "_id": NumberInt(66),
        "movie": NumberInt(15),
        "review": "I considered The Fellowship of the Ring to be one of the greatest movies ever. This one is better!"
    },
    {
        "_id": NumberInt(67),
        "movie": NumberInt(15),
        "review": "We have been waiting an entire year for this one!!! The Two Towers picks up right where last years Lord of the Rings: The Fellowship of the Ring leaves off. The director, Peter Jackson, did not include a recap of the last movie, so if you don't remember what happened in the first movie you better rent it and refresh your memory before you head off to the theater."
    }
]